// সর্বপ্রথম google.com ফায়ার ভেসে যাবো তারপরে গো টু কনসোলে যাব
// এরপরে ফায়ার পেইসে ক্রিয়েট এ ফায়ার এস নামে একটি ফাইল তৈরি করতে হবে যেকোনো নামে
// এরপরে ওয়েব সেটিংসে যাইতে হবে তারপরে ফায়ার বেসের অ্যাপ রেজিস্টার করতে হবে
// এরপরে এনপিএম ইনস্টল ফায়ার ভয়েস করতে হবে
// ফেয়ার বেস ইন্সটল করার পরে যে একটি কমান্ড আছে সে কমান্ডটি এস আর সির ভিতরে একটি ফোল্ডার খুলে তার ফাইলে রাখতে হবে কিন্তু আসলে এটা রাখা উচিত নয়
// এরপরে এনাবেল করতে হবে যেরকম বাম পাশে বিল্ডের ভিতরে অথেন্টিকেশনের ভিতর দেখে বিল্ড করতে হবে
// এরপরে ফায়ারবাস ডক্সে যেতে হবে এবং ডক্স থেকে বিলে যেতে হবে তার ভিতর থেকে গেট স্টার্টে যেতে হবে এরপরে উপর নিচে দুইটি কমান্ড দিতে হবে
// এরপরে google প্রোভাইডার কোড ইমপোর্ট করতে হবে
// এরপরে একটি লগইন বাটন দিতে হবে যার সাথে একটি ইভেন হ্যান্ডলার দিতে হবে এবং তার সাথে ক্লোরাইডের দিতে হবে যেটির নাম হবে গুগল প্রোভাইডার বা গিটার প্রোভাইডার